// 1. Останнє значення циклу
// Яке останнє значення буде виведено на екран? Чому?
let i = 3;

while (i) {
  alert( i-- );
}
// виведе 3, 2, 1 Бо while (i) означає while (i !=0), тобто як тільки i стане нулем, цикл буде завершено. 

// 2. Яке значення виведе цикл "while"?
// Префіксна форма ++i:
let i = 0;
while (++i < 5) alert( i ); // 1,2,3,4

// Постфіксна форма i++
let i = 0;
while (i++ < 5) alert( i ); // 1,2,3,4,5

// 3. Яке значення виведе цикл "for"?
// Постфіксна форма:
for (let i = 0; i < 5; i++) alert( i ); // 0,1,2,3,4

// Префіксна форма:
for (let i = 0; i < 5; ++i) alert( i ); // 0,1,2,3,4

// 4. Виведіть парні числа
// Виведіть парні числа від 2 до 10, використовуючи цикл for.
for (let i = 2; i <= 10; i++) {

    if (i % 2 == 0) {
      alert( i );
    }
  
  }

// 5. Замініть цикл "for" на "while"
// Було 
for (let i = 0; i < 3; i++) {
    alert( `число ${i}!` );
  }

// Стало
let i = 0;

while (i < 3) {
    alert(`число ${i}!`);
    i++
}

// 6. Повторяти цикл, доки ввід невірний
// Напишіть цикл, який пропонує prompt ввести число більше за 100. 
// Якщо відвідувач введе інше число – попросити ввести ще раз, і так далі.
// Цикл повинен запитувати число доти, доки відвідувач не введе число, більше за 100, або не скасує ввід/введе порожній рядок.

let inputNumber;

do {
    inputNumber = prompt('Введіть число більше 100', '');

} while (inputNumber <= 100 || inputNumber == null || inputNumber == '');

// 7. Вивести прості числа 
// Напишіть код, який виводить всі прості числа в діапазоні від 2 до n.

// Сорі, не вивіз цю задачу.