/* 9. Напишіть код, який запитує логін за допомогою prompt.
Якщо відвідувач вводить "Admin", тоді запропонуйте за допомогою prompt ввести пароль. 
Якщо введено порожній рядок або натиснуто Esc – показати “Скасовано”. 
Якщо введено інший рядок – тоді покажіть “Я вас не знаю”.

Пароль перевіряється наступним чином:
Якщо він дорівнює “Господар”, тоді покажіть “Ласкаво просимо!”,
Інший рядок – покажіть “Неправильний пароль”,
Для порожнього рядка, або якщо введення було скасовано, покажіть “Скасовано”.
*/

let userLogin = prompt('Login:', '');

if (userLogin == 'Admin') {
    let userPassword = prompt('Password:', '');
    if (userPassword == 'Господар') {
        alert('Ласкаво просимо!');
    } else if (userPassword == '' || userPassword == null) {
        alert('Скасовано');
    } else {
        alert('Неправильний пароль');
    }

} else if (userLogin == '' || userLogin == null) {
alert('Скасовано');
} else {
alert('Я вас не знаю');
}