 // 1. Що виведе код нижче?
 alert( null || 2 || undefined ); // 2

 // 2. Що виведе код нижче?
 alert( alert(1) || 2 || alert(3) ); // alert(1)

// 3. Що виведе код нижче?
alert( 1 && null && 2 ); // null

// 4. Що виведе код нижче?
alert( alert(1) && alert(2) ); // alert(1)

// 5. Який буде результат?
alert( null || 2 && 3 || 4 ); // 3

// 6. Напишіть умову if, щоб перевірити, чи age знаходиться між 14 та 90 включно.
let age = 66;
if (age >= 14 && age <= 90) {
    console.log('You have the right age to enter.')
}

// 7. Напишіть умову if, щоб перевірити, чи значення age НЕ знаходиться між 14 та 90 включно.
// Створіть два варіанти: перший з оператором НЕ !
let age = 1;
if (!(age >= 14 && age <= 90)) // ніхера не зрозумів як воно працює, просто дурка якась 

// Створіть два варіанти: другий — без нього.
if (age < 14 || age > 90)

// 8. Які з цих alert буде виконано?
if (-1 || 0) alert( 'перший' ); // виконається, бо перше значення правдиве
if (-1 && 0) alert( 'другий' ); // не виконається, бо серед двох значень обереться 0 і тому буде false
if (null || -1 && 1) alert( 'третій' ); // виконається, бо з -1 та 1 повернеться останнє правдиве значення, тобто 1