// 1. Постфіксна та префіксна форми
// Які кінцеві значення всіх змінних a, b, c та d після виконання коду нижче?

let a = 1, b = 1;

let c = ++a; // 2
let d = b++; // 1

console.log(c,d);

// 2. Результат присвоєння
// Які значення мають a та x після виконання коду нижче?
let a = 2;

let x = 1 + (a *= 2); // x = 5, (a=4)
// let x = 1 + (a = a * 2);

// 3. Перетворення типу
// Які результати цих виразів? 

"" + 1 + 0 // 10
"" - 1 + 0 // -1
true + false // 1
6 / "3" // 2
"2" * "3" // 6
4 + 5 + "px" 9px
"$" + 4 + 5 // $45
"4" - 2 // 2
"4px" - 2 // NaN
"  -9  " + 5 // -9 5
"  -9  " - 5 // -14
null + 1 // 1
undefined + 1 // NaN
" \t \n" - 2 // -2 

// 4. Виправте додавання
// Нижче наведено код, що просить користувача ввести два числа і відображає їхню суму. 
// Він працює неправильно. Код у прикладі виводить 12 (для початкових значень у полях вводу).
// У чому помилка? Виправте її. Результат має бути 3.

let a = prompt("Перше число?", 1);
let b = prompt("Друге число?", 2);
a = Number(a);
b = Number(b);
alert(a + b); // 12