//                          Що таке class?
//
// Клас - конструкція, яка використовується для групування пов’язаних змінних та функцій.
// Також може використовуватись як шаблон для створення об’єктів що є подібними один до одного.
//
//

// Синтаксис класу
// class MyClass {
//     constructor() { ... }
//     method1() { ... }
//     method2() { ... }
//     method3() { ... }
//     ...
//   }

//                          Важливо памʼятати 
//
// 1) Назва класу пишеться з великої букви.

// 2) Клас не може існувати без constructor'а. Він отримує параметри і буде присвоювати їх в якості нових властивостей для наших обʼєктів.
//    В певному сенсі constructor - функція для створення обʼєктів.

// 3) Клас може містити всередині методи та функції.

// 4) Щоб створити обʼєкт за шаблоном: let object = new ClassName(параметр1, параметр2, ...);

// 5) Формально клас - це і є функція, але з певним рівнем абстракції. Це легко перевірити.

// 6) Хоча клас і є функцією, він не є "синтаксичним цукром" в повній мірі.  


// Приклад класу для авто
class Car {
  constructor(brand, engine, weight, country) {
    this.brand = brand;
    this.engine = engine;
    this.weight = weight;
    this.country = country;
  }
}

// Створюємо обʼєкт за шаблоном
let car1 = new Car("Fiat", "petrol", "1200", "Italy");

// // Перевіряємо, як виглядає новостворений обʼєкт
// console.log(car1);

// // Переконуємось, що насправді клас Car є функцією
// console.log(typeof Car);

// // Переконуємось, car1 - то є обʼєкт
console.log(typeof car1);